Repository: grm34/DistroHopper
Catalog: locale/*.po
Languages: cs

source: Done
cs: Hotovo

source: PS: You saw some bugs?
cs: PS: Viděli jste nějaké chyby?

source: Could you please provide feedback?
cs: Můžete prosím poslat zpětnou vazbu?

source: How do you like DistroHopper?
cs: Jak se vám líbí DistroHopper?

source: What can be improved, added, changed?
cs: Co může být vylepšeno, přidáno, změněno?

source: Let me know...
cs: Dejte mi vědět...

source: Wish you flawless distro hopping...
cs: Přeji bezchybné zkoušení operačních systémů...

source: \texample for First run from terminal: ./dh i && dh s g\n
cs: \tpříklad pro první spuštění z příkazové řádky: ./dh i && dh s g\n

source: Possible arguments:
cs: Možné argumenty:

source: \th\thelp\t\t\tShow this help and exit\n
cs: \th help\t\t\tZobrazit tuto nápovědu a skončit\n

source: \td\tdir\t\t\tSet default directory where VMs are stored\n
cs: \td\tdir\t\t\tNastavit adresář kde jsou virtuální stroje uloženy\n

source: \ti\tinstall\t\t\tInstall DistroHopper\n
cs: \ti\tinstall\t\t\tInstalovat DistroHopper\n

source: \tm\tmode\t\t\tPortable mode\n
cs: \tm\tmode\t\t\tPřenosný mód\n

source: \ts\tsupported\t\tUpdate supported VMs\n
cs: \ts\tsupported\t\tAktualizovat podporované VM\n

source: \tr\tready\t\t\tUpdate ready to run VMs\n
cs: \tr\tready\t\t\tAktualizovat připravené VM\n

source: \tt\ttui\t\t\tRun terminal user interface (TUI)\n
cs: \tt\ttui\t\t\tSpustit uživatelské rozhranní v terminálu (TUI)\n

source: \tg\tgui\t\t\tRun graphical user interface (GUI)\n
cs: \tg\tgui\t\t\tSpustit grafické uživatelské rozhranní (GUI)\n

source: \ta\tadd\t\t\tAdd new distro to quickget\n
cs: \ta\tadd\t\t\tPřidat distribuci do quickget\n

source: \tf\tfunctions\t\tSort functions in quickget\n
cs: \tf\tfunctions\t\tSeřadit funkce v quickget\n

source: \tp\tpush\t\t\tPush changed quickget to quickemu project #todo\n
cs: \tp\tpush\t\t\tPoslat změněný quickget do quickemu projektu #UDELAT\n

source: \tc\tcopy\t\t\tCopy all ISOs to target dir (for Ventoy)\n
cs: \tc\tcopy\t\t\tKopírovat všechny ISO to cílového adresáře (pro Ventoy)\n

source: \tl\tlanguage\t\tTranslate DistroHopper\n
cs: \tl\tlanguage\t\tPřeložit DistroHopper\n

source: Homepage: dh.osowoso.xyz
cs: Domovský stránka: dh.osowoso.xyz

source: Project hosted at: https://github.com/oSoWoSo/DistroHopper
cs: Projekt hostován na: https://github.com/oSoWoSo/DistroHopper

source: Chat group on SimpleX: https://tinyurl.com/7hm4kcjx
cs: Chat skupina na SimpleX: https://tinyurl.com/7hm4kcjx

source: Missing yad!
cs: Chybí vám yad!

source: Missing fzf!
cs: Chybí vám fzf!

source: creating config dir...
cs: vytvářím adresář konfigurace...

source: creating icons dir as root...
cs: vytvářím adresář ikon jako správce...

source: Copying icons...
cs: Kopíruji ikony...

source: Copying to config dir...
cs: Kopíruji do konfig adresáře...

source: Creating directory structure...
cs: Vytvářím adresářovou stukturu...

source: Setting up directory...
cs: Nastavuji adresář...

source: Installing needed...
cs: Instaluji potřebné...

source: Installing DistroHopper to bin...
cs: Instaluji DistroHopper do bin...

source: Creating desktop file for $vm_desktop...
cs: Vytvářím soubor desktop pro $vm_desktop...

source: Prepared VMs:\n-------------\n\n
cs: Připravené VM:\n-------------\n\n

source: No VMs found.
cs: Žádný VM nenalezen.

source: Do you want to create a new VM? (c)
cs: Chcete vytvořit nový VM? (c)

source: or run an existing one? (press anything)\n
cs: nebo spustit existující? (stiskněte cokoli\n

source: \n Trying to download Windows %s %s...\n\n
cs: \n Zkouším stáhnout Windows %s %s...\n\n

source: \n Trying to download %s %s...\n\n
cs: \n Zkouším stáhnout %s %s...\n\n

source: \n Trying to download %s %s %s...\n\n
cs: \n Zkouším stáhnout %s %s %s...\n\n

source: \n Starting %s...\n\n
cs: \n Začínám %s...\n\n

source: Which language change? (en/cs)
cs: Který jazyk upravit? (en/cs)

source: If you want create new one, insert two digit language code...
cs: Pokud chcete vytvořit nový, vložte dvoumístný jazykový kód...

source: Choosed language is: $lang
cs: Vybraný jazyk je: $lang

source: Dumping language source...
cs: Vytváření jazykového zdroje..

source: Merging changes... (Do it yourself)
cs: Slučuji změny... (Udělej sám)

source: Generating .mo file...
cs: Vytvářím soubor .mo...

source: Do you want copy $lang translation to '/usr/share/local' as root? (y/n)
cs: Chcete zkopírovat $lang překlad do '/usr/share/local' jako správce? (a/n)

source: Copying translation to '/usr/share/local'...
cs: Kopíruji překlad do '/usr/share/local'...

source: No argumet provided!\n\n
cs: Nezadali jste žádný argument!\n\n

source: Starting installation...
cs: Zahajuji instalaci...

source: Switching to portable mode!
cs: Přepínám do přenosného módu!

source: Updating supported VMs...
cs: Aktualizuji podporované VM...

source: Updating ready VMs...
cs: Aktualizuji připravené VM...

source: Running DistroHopper TUI...
cs: Spouštím DistroHopper TUI...

source: Starting DistroHopper GUI...
cs: Spouštím DistroHopper GUI...

source: Adding new distro started...
cs: Přidání nového distra zahájeno...

source: Sorting functions in template...
cs: Srovnávám funkce v šabloně...

source: Pushing changes to... #TODO
cs: Posílám změny do... #UDELAT

source: Copying ISOs to dir. It will take some time...
cs: Kopíruji soubory ISO do adresáře. Zabere to nějaký čas...

source: Invalid option: $1
cs: Chybný argument: $1
